const gameText = {
  拳王: [
    '機種概要 TYPE-C 彩池(ストック/STOCK)機 AT(ASSISTTIME/指示時間)機能搭載天井(中獎最大間隔1999＋32)',

    '10回的AT，只有8次的15枚小獎。但例外的是「純槓龜」或者是「特殊綠瓜」有時也會引發JAC IN。TYPE-C機種並沒有BIG（大獎彩金），只有REG（通常彩金／JAC遊戲１回）。sJAC遊戲:一般來說有特定獎項8回，最大12回。',

    `「北斗之拳」是靠著戰鬥彩金【BB】的連莊來累積增加代幣
    「BB」＝「9回的AT」＋「REG」
    AT（Assist Time/指示時間）
    押牌依照機台指示，即可輕易獲得分數。
    在北斗之拳的機台裡，黃鐘的獲得共有六種順序。`,

    `
    [123][132][213][231][312][321]
    只要猜中順序不用瞄準，即可輕易中獎，獲得10枚代幣。
    但是戰鬥彩金（以下BB）並非於每次遊戲拉桿啟動時抽選，而是通過小牌【青再、紅櫻、綠瓜】的升格、降格所決定。
    `,

    `
    關於連莊機能：連莊機能並非由【7】或【北斗】所發動。而是【REG（通常彩金）】。【7】或【北斗】僅是單純的模式移行的必要契機。所以北斗之拳並無明確的連莊數。而是經由每次的「BB」＝「9回的AT」+「REG」中的「REG」所抽選決定。
    `,

    `
    關於戰鬥彩金BB戰鬥彩金BATTLE BONUS是由[小牌指示]+[JAC IN指示]共計10回合的AT所構成。
    `,

    `
    『小牌指示』通常時經常猜錯的六順黃鐘（ベル）以及其他的小牌所構成。例如[132]指示的話[左右中]的順序押牌，將獲得10枚代幣。
    `,

    `
    [JAC IN指示]順著指示押中JAC圖案（JAC）的話，JAC遊戲啟動。（JAC遊戲於15枚小獎獲得8回後結束）在「北斗之拳」是以BB的連莊來累積增加代幣！
    `,

    `
    BB獲得到結束的流程「北斗之拳」是由各種［模式］所構成，拉桿啟動時決定下列各種獎項:內部REG、青再、黃鐘、紅櫻、綠瓜、沒中及機會牌等項目，再由機台控制轉輪得到下列結果:
    `,
    `
    青再・・・中獎青再（青再Ａ）、沒中青再（青再Ｂ）、機會青再（青再Ｃ）
    黃鐘・・・６種押順黃鐘、無押順黃鐘
    紅櫻・・・中段紅櫻、角紅櫻
    綠瓜・・・・綠瓜Ａ、綠瓜Ｂ
    等等不同結果。
    `,

    `
    在這些小牌中，與［模式］的升格或降格有關的有下列幾種：青再Ａ、青再Ｃ、中段紅櫻、角紅櫻、綠瓜Ａ、綠瓜Ｂ，上述六種小牌成立時機台內部將進行［模式］的升格或降格的抽選。
    `,
    `
    除非抽選到［７連線模式］，否則是押不到［７］連線的。
    同樣的，抽選到［北斗連線模式］，才有可能押到［北斗］連線。
    因此經由特定小牌的成立，而抽選進入［前兆模式］，再抽選成立
    ［７］或［北斗］模式是通常開牌的必要條件。
    但有時中了特定小牌，卻沒有發生［模式轉移］，就跟機台本身的設計有關了。
    並非每次都會發生［模式轉移］的。
    `,
  ],

};

export default gameText;
